java/springboot.org
#+TITLE:     SpingBoot
#+AUTHOR:    Hao Ruan
#+EMAIL:     haoru@cisco.com
#+LANGUAGE:  en
#+LINK_HOME: http://www.github.com/ruanhao
#+OPTIONS:   h:6 html-postamble:nil html-preamble:t tex:t f:t ^:nil
#+TOC:       headlines 4
#+HTML_DOCTYPE: <!DOCTYPE html>
#+HTML_HEAD: <link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
#+HTML_HEAD: <link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
#+HTML: <div class="outline-2" id="meta">
| Author   | {{{author}}} ({{{email}}})    |
| Date     | {{{time(%Y-%m-%d %H:%M:%S)}}} |
#+HTML: </div>

* 原理概念

* 常用实践

** [[https://github.com/ruanhao/show-me-the-code/tree/springboot-restful-service][Restful Service (MVC)]]

*** WebApplicationInitializer

实现 =WebApplicationInitializer= 接口便可以实现等同于对 =web.xml= 进行配置

*** Controller

#+BEGIN_SRC java
  @RestController
  @RequestMapping("/{userId}/bookmarks")
  class BookmarkRestController {

      @PostMapping
      ResponseEntity<?> add(@PathVariable String userId, @RequestBody Bookmark input) {
          return ResponseEntity.noContent().build();
      }
  }
#+END_SRC


*** HttpMessageConverter

对每个 HTTP 请求，Spring MVC 将遍历所有配置的 HttpMessageConverter 对象，
直到找到一个合适的对象可以将返回的 POJO 转换成 Accept header 中指定的 content type 。

Spring Boot 会自动组装一个可以转换成 JSON 类型的 HttpMessageConverter 对象。

HttpMessageConverter 工作于两个方向：
- 请求（ content-type => Java object ）
- 响应（ Java object => content-type ）


*** 异常处理

**** 异常级别

正常情况下，任何未被处理的异常将导致服务器返回 HTTP 500 Response 。
自定义的异常可以通过添加 =@ResponseStatus= 注解从而使用指定的 status code 。

#+BEGIN_SRC java
   @ResponseStatus(value=HttpStatus.NOT_FOUND, reason="No such Order")  // 404
   public class OrderNotFoundException extends RuntimeException {
       // TODO
   }
#+END_SRC

#+BEGIN_SRC java
  @RequestMapping(value="/orders/{id}", method=GET)
  public String showOrder(@PathVariable("id") long id, Model model) {
      Order order = orderRepository.findOrderById(id);

      if (order == null) throw new OrderNotFoundException(id);

      model.addAttribute(order);
      return "orderDetail";
  }
#+END_SRC



