java/springboot.html
<!DOCTYPE html>
<html>
<head>
<title>SpingBoot</title>
<!-- 2018-02-16 Fri 10:31 -->
<meta  charset="utf-8">
<meta  name="generator" content="Org-mode">
<meta  name="author" content="Hao Ruan">
<link href="http://fonts.googleapis.com/css?family=Roboto+Slab:400,700|Inconsolata:400,700" rel="stylesheet" type="text/css" />
<link href="../org-html-themes/css/style.css" rel="stylesheet" type="text/css" />
</head>
<body>
<div id="content">
<h1 class="title">SpingBoot</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 原理概念</a></li>
<li><a href="#sec-2">2. 常用实践</a>
<ul>
<li><a href="#sec-2-1">2.1. Restful Service (MVC)</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. WebApplicationInitializer</a></li>
<li><a href="#sec-2-1-2">2.1.2. Controller</a></li>
<li><a href="#sec-2-1-3">2.1.3. HttpMessageConverter</a></li>
<li><a href="#sec-2-1-4">2.1.4. 异常处理</a>
<ul>
<li><a href="#sec-2-1-4-1">2.1.4.1. 异常级别</a></li>
<li><a href="#sec-2-1-4-2">2.1.4.2. 控制器级别</a></li>
<li><a href="#sec-2-1-4-3">2.1.4.3. 全局级别</a>
<ul>
<li><a href="#sec-2-1-4-3-1">2.1.4.3.1. 重新抛出</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Application Event</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Event</a></li>
<li><a href="#sec-2-2-2">2.2.2. Listener</a></li>
<li><a href="#sec-2-2-3">2.2.3. Publisher</a></li>
<li><a href="#sec-2-2-4">2.2.4. 自定义 applicationEventMulticaster</a></li>
<li><a href="#sec-2-2-5">2.2.5. 常见 SpringApplicationEvent</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Async Method</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 异常统一捕获</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Scheduling Tasks</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. 启用计划任务</a></li>
<li><a href="#sec-2-4-2">2.4.2. 任务执行</a>
<ul>
<li><a href="#sec-2-4-2-1">2.4.2.1. 每隔固定时间执行</a></li>
<li><a href="#sec-2-4-2-2">2.4.2.2. 指定任务间隔</a></li>
<li><a href="#sec-2-4-2-3">2.4.2.3. UNIX Cron 风格</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Type Safe Configuration Properties</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. 配置文件</a></li>
<li><a href="#sec-2-5-2">2.5.2. Properties Bean</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6. 内容注入</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 注入普通字符串</a></li>
<li><a href="#sec-2-6-2">2.6.2. 注入操作系统属性</a></li>
<li><a href="#sec-2-6-3">2.6.3. 注入表达式结果</a></li>
<li><a href="#sec-2-6-4">2.6.4. 注入其他 Bean 属性</a></li>
<li><a href="#sec-2-6-5">2.6.5. 注入文件资源</a></li>
<li><a href="#sec-2-6-6">2.6.6. 注入网址资源</a></li>
<li><a href="#sec-2-6-7">2.6.7. 从配置文件注入</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1. 原理概念</a></li>
<li><a href="#sec-2">2. 常用实践</a>
<ul>
<li><a href="#sec-2-1">2.1. Restful Service (MVC)</a>
<ul>
<li><a href="#sec-2-1-1">2.1.1. WebApplicationInitializer</a></li>
<li><a href="#sec-2-1-2">2.1.2. Controller</a></li>
<li><a href="#sec-2-1-3">2.1.3. HttpMessageConverter</a></li>
<li><a href="#sec-2-1-4">2.1.4. 异常处理</a>
<ul>
<li><a href="#sec-2-1-4-1">2.1.4.1. 异常级别</a></li>
<li><a href="#sec-2-1-4-2">2.1.4.2. 控制器级别</a></li>
<li><a href="#sec-2-1-4-3">2.1.4.3. 全局级别</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-2">2.2. Application Event</a>
<ul>
<li><a href="#sec-2-2-1">2.2.1. Event</a></li>
<li><a href="#sec-2-2-2">2.2.2. Listener</a></li>
<li><a href="#sec-2-2-3">2.2.3. Publisher</a></li>
<li><a href="#sec-2-2-4">2.2.4. 自定义 applicationEventMulticaster</a></li>
<li><a href="#sec-2-2-5">2.2.5. 常见 SpringApplicationEvent</a></li>
</ul>
</li>
<li><a href="#sec-2-3">2.3. Async Method</a>
<ul>
<li><a href="#sec-2-3-1">2.3.1. 异常统一捕获</a></li>
</ul>
</li>
<li><a href="#sec-2-4">2.4. Scheduling Tasks</a>
<ul>
<li><a href="#sec-2-4-1">2.4.1. 启用计划任务</a></li>
<li><a href="#sec-2-4-2">2.4.2. 任务执行</a>
<ul>
<li><a href="#sec-2-4-2-1">2.4.2.1. 每隔固定时间执行</a></li>
<li><a href="#sec-2-4-2-2">2.4.2.2. 指定任务间隔</a></li>
<li><a href="#sec-2-4-2-3">2.4.2.3. UNIX Cron 风格</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#sec-2-5">2.5. Type Safe Configuration Properties</a>
<ul>
<li><a href="#sec-2-5-1">2.5.1. 配置文件</a></li>
<li><a href="#sec-2-5-2">2.5.2. Properties Bean</a></li>
</ul>
</li>
<li><a href="#sec-2-6">2.6. 内容注入</a>
<ul>
<li><a href="#sec-2-6-1">2.6.1. 注入普通字符串</a></li>
<li><a href="#sec-2-6-2">2.6.2. 注入操作系统属性</a></li>
<li><a href="#sec-2-6-3">2.6.3. 注入表达式结果</a></li>
<li><a href="#sec-2-6-4">2.6.4. 注入其他 Bean 属性</a></li>
<li><a href="#sec-2-6-5">2.6.5. 注入文件资源</a></li>
<li><a href="#sec-2-6-6">2.6.6. 注入网址资源</a></li>
<li><a href="#sec-2-6-7">2.6.7. 从配置文件注入</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>
<div class="outline-2" id="meta">
<table>


<colgroup>
<col  class="left">

<col  class="left">
</colgroup>
<tbody>
<tr>
<td class="left">Author</td>
<td class="left">Hao Ruan (haoru@cisco.com)</td>
</tr>

<tr>
<td class="left">Date</td>
<td class="left">2018-02-16 10:31:47</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 原理概念</h2>
</div>

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 常用实践</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> <a href="https://github.com/ruanhao/show-me-the-code/tree/springboot-restful-service">Restful Service (MVC)</a></h3>
<div class="outline-text-3" id="text-2-1">
</div><div id="outline-container-sec-2-1-1" class="outline-4">
<h4 id="sec-2-1-1"><span class="section-number-4">2.1.1</span> WebApplicationInitializer</h4>
<div class="outline-text-4" id="text-2-1-1">
<p>
实现 <code>WebApplicationInitializer</code> 接口便可以实现等同于对 <code>web.xml</code> 进行配置
</p>
</div>
</div>

<div id="outline-container-sec-2-1-2" class="outline-4">
<h4 id="sec-2-1-2"><span class="section-number-4">2.1.2</span> Controller</h4>
<div class="outline-text-4" id="text-2-1-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@RestController</span>
<span style="color: #5fafd7;">@RequestMapping</span>(<span style="color: #ff4ea3;">"/{userId}/bookmarks"</span>)
<span style="color: #a1db00;">class</span> <span style="color: #00d7af;">BookmarkRestController</span> {

    <span style="color: #5fafd7;">@PostMapping</span>
    <span style="color: #00d7af;">ResponseEntity</span>&lt;?&gt; <span style="color: #ffd700;">add</span>(<span style="color: #5fafd7;">@PathVariable</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">userId</span>, <span style="color: #5fafd7;">@RequestBody</span> <span style="color: #00d7af;">Bookmark</span> <span style="color: #ff8700;">input</span>) {
        <span style="color: #a1db00;">return</span> ResponseEntity.noContent().build();
    }
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-1-3" class="outline-4">
<h4 id="sec-2-1-3"><span class="section-number-4">2.1.3</span> HttpMessageConverter</h4>
<div class="outline-text-4" id="text-2-1-3">
<p>
对每个 HTTP 请求，Spring MVC 将遍历所有配置的 HttpMessageConverter 对象，
直到找到一个合适的对象可以将返回的 POJO 转换成 Accept header 中指定的 content type 。
</p>

<p>
Spring Boot 会自动组装一个可以转换成 JSON 类型的 HttpMessageConverter 对象。
</p>

<p>
HttpMessageConverter 工作于两个方向：
</p>
<ul class="org-ul">
<li>请求（ content-type =&gt; Java object ）
</li>
<li>响应（ Java object =&gt; content-type ）
</li>
</ul>
</div>
</div>


<div id="outline-container-sec-2-1-4" class="outline-4">
<h4 id="sec-2-1-4"><span class="section-number-4">2.1.4</span> 异常处理</h4>
<div class="outline-text-4" id="text-2-1-4">
</div><div id="outline-container-sec-2-1-4-1" class="outline-5">
<h5 id="sec-2-1-4-1"><span class="section-number-5">2.1.4.1</span> 异常级别</h5>
<div class="outline-text-5" id="text-2-1-4-1">
<p>
正常情况下，任何未被处理的异常将导致服务器返回 HTTP 500 Response 。
自定义的异常可以通过添加 <code>@ResponseStatus</code> 注解从而使用指定的 status code 。
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@ResponseStatus</span>(value=<span style="color: #5fafd7;">HttpStatus</span>.NOT_FOUND, reason=<span style="color: #ff4ea3;">"No such Order"</span>)  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">404</span>
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">OrderNotFoundException</span> <span style="color: #a1db00;">extends</span> <span style="color: #00d7af;">RuntimeException</span> {
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">TODO</span>
}
</pre>
</div>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@RequestMapping</span>(value=<span style="color: #ff4ea3;">"/orders/{id}"</span>, method=GET)
<span style="color: #a1db00;">public</span> <span style="color: #00d7af;">String</span> <span style="color: #ffd700;">showOrder</span>(<span style="color: #5fafd7;">@PathVariable</span>(<span style="color: #ff4ea3;">"id"</span>) <span style="color: #00d7af;">long</span> <span style="color: #ff8700;">id</span>, <span style="color: #00d7af;">Model</span> <span style="color: #ff8700;">model</span>) {
    <span style="color: #00d7af;">Order</span> <span style="color: #ff8700;">order</span> = orderRepository.findOrderById(id);

    <span style="color: #a1db00;">if</span> (order == <span style="color: #5fafd7;">null</span>) <span style="color: #a1db00;">throw</span> <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">OrderNotFoundException</span>(id);

    model.addAttribute(order);
    <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"orderDetail"</span>;
}
</pre>
</div>
</div>
</div>
