java/springboot.org
**** 控制器级别

使用 =@ExceptionHandler= 注解处理同一个控制器中抛出的异常，这种方式的优点：

- 可以处理没有被 =@ResponseStatus= 注解过的异常
- 可以将用户重定向到专门的错误页面
- 组装一个完全定制化的 error response

#+BEGIN_SRC java
  @Controller
  public class ExceptionHandlingController {

      // @RequestHandler methods that maybe throw exception
      ...


      // Exception handling methods:

      // Convert a predefined exception to an HTTP Status code
      @ResponseStatus(value=HttpStatus.CONFLICT, reason="Data integrity violation")  // 409
      @ExceptionHandler(DataIntegrityViolationException.class)
      public void conflict() {
          // TODO
      }

      // Specify name of a specific view that will be used to display the error:
      @ExceptionHandler({SQLException.class, DataAccessException.class})
      public String databaseError() {
          // Nothing to do.  Returns the logical view name of an error page, passed
          // to the view-resolver(s) in usual way.
          return "databaseError";
      }

      // Total control - setup a model and return the view name yourself. Or
      // consider subclassing ExceptionHandlerExceptionResolver.
      @ExceptionHandler(Exception.class)
      public ModelAndView handleError(HttpServletRequest req, Exception ex) {
          logger.error("Request: " + req.getRequestURL() + " raised " + ex);

          ModelAndView mav = new ModelAndView();
          mav.addObject("exception", ex);
          mav.addObject("url", req.getRequestURL());
          mav.setViewName("error");
          return mav;
      }
  }
#+END_SRC

**** 全局级别

任何标注 =@ControllerAdvice= / =@RestControllerAdvice= 注解的类支持 3 种类型的方法：

- Exception handling methods annotated with =@ExceptionHandler=
- Model enhancement methods (for adding additional data to the model) annotated with =@ModelAttribute=
- Binder initialization methods (used for configuring form-handling) annotated with =@InitBinder=


#+BEGIN_SRC java
  @ControllerAdvice
  class GlobalControllerExceptionHandler {
      @ResponseStatus(HttpStatus.CONFLICT)  // 409
      @ExceptionHandler(DataIntegrityViolationException.class)
      public void handleConflict() {
          // Nothing to do
      }
  }
#+END_SRC

***** 重新抛出

#+BEGIN_SRC java
  @ControllerAdvice
  class GlobalDefaultExceptionHandler {
    public static final String DEFAULT_ERROR_VIEW = "error";

    @ExceptionHandler(value = Exception.class)
    public ModelAndView defaultErrorHandler(HttpServletRequest req, Exception e) throws Exception {
      // If the exception is annotated with @ResponseStatus rethrow it and let
      // the framework handle it - like the OrderNotFoundException example
      // at the start of this post.
      // AnnotationUtils is a Spring Framework utility class.
      if (AnnotationUtils.findAnnotation(e.getClass(), ResponseStatus.class) != null)
        throw e;

      // Otherwise setup and send the user to a default error-view.
      ModelAndView mav = new ModelAndView();
      mav.addObject("exception", e);
      mav.addObject("url", req.getRequestURL());
      mav.setViewName(DEFAULT_ERROR_VIEW);
      return mav;
    }
  }
#+END_SRC



** [[https://github.com/ruanhao/show-me-the-code/tree/springboot-application-event][Application Event]]

*** Event

    #+BEGIN_SRC java
  @ToString
  public class Event extends ApplicationEvent {

      private static final long serialVersionUID = 1L;

      @Getter
      private String message;

      public Event(Object source, String message) {
          super(source);
          this.message = message;
      }

  }
    #+END_SRC


*** Listener

    #+BEGIN_SRC java
  @Component
  @Slf4j
  public class Listener {

      @EventListener
      public void handlerEvent(Event event) {
          log.info("Receive event: {}", event);
      }

  }
    #+END_SRC


