java/springboot.html



<div id="outline-container-sec-2-1-4-2" class="outline-5">
<h5 id="sec-2-1-4-2"><span class="section-number-5">2.1.4.2</span> 控制器级别</h5>
<div class="outline-text-5" id="text-2-1-4-2">
<p>
使用 <code>@ExceptionHandler</code> 注解处理同一个控制器中抛出的异常，这种方式的优点：
</p>

<ul class="org-ul">
<li>可以处理没有被 <code>@ResponseStatus</code> 注解过的异常
</li>
<li>可以将用户重定向到专门的错误页面
</li>
<li>组装一个完全定制化的 error response
</li>
</ul>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Controller</span>
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">ExceptionHandlingController</span> {

    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">@RequestHandler methods that maybe throw exception</span>
    ...


    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Exception handling methods:</span>

    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Convert a predefined exception to an HTTP Status code</span>
    <span style="color: #5fafd7;">@ResponseStatus</span>(value=<span style="color: #5fafd7;">HttpStatus</span>.CONFLICT, reason=<span style="color: #ff4ea3;">"Data integrity violation"</span>)  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">409</span>
    <span style="color: #5fafd7;">@ExceptionHandler</span>(DataIntegrityViolationException.<span style="color: #a1db00;">class</span>)
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">void</span> conflict() {
        <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">TODO</span>
    }

    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Specify name of a specific view that will be used to display the error:</span>
    <span style="color: #5fafd7;">@ExceptionHandler</span>({SQLException.<span style="color: #a1db00;">class</span>, DataAccessException.<span style="color: #a1db00;">class</span>})
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">String</span> <span style="color: #ffd700;">databaseError</span>() {
        <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Nothing to do.  Returns the logical view name of an error page, passed</span>
        <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">to the view-resolver(s) in usual way.</span>
        <span style="color: #a1db00;">return</span> <span style="color: #ff4ea3;">"databaseError"</span>;
    }

    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Total control - setup a model and return the view name yourself. Or</span>
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">consider subclassing ExceptionHandlerExceptionResolver.</span>
    <span style="color: #5fafd7;">@ExceptionHandler</span>(Exception.<span style="color: #a1db00;">class</span>)
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">ModelAndView</span> <span style="color: #ffd700;">handleError</span>(<span style="color: #00d7af;">HttpServletRequest</span> <span style="color: #ff8700;">req</span>, <span style="color: #00d7af;">Exception</span> <span style="color: #ff8700;">ex</span>) {
        logger.error(<span style="color: #ff4ea3;">"Request: "</span> + req.getRequestURL() + <span style="color: #ff4ea3;">" raised "</span> + ex);

        <span style="color: #00d7af;">ModelAndView</span> <span style="color: #ff8700;">mav</span> = <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">ModelAndView</span>();
        mav.addObject(<span style="color: #ff4ea3;">"exception"</span>, ex);
        mav.addObject(<span style="color: #ff4ea3;">"url"</span>, req.getRequestURL());
        mav.setViewName(<span style="color: #ff4ea3;">"error"</span>);
        <span style="color: #a1db00;">return</span> mav;
    }
}
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-1-4-3" class="outline-5">
<h5 id="sec-2-1-4-3"><span class="section-number-5">2.1.4.3</span> 全局级别</h5>
<div class="outline-text-5" id="text-2-1-4-3">
<p>
任何标注 <code>@ControllerAdvice</code> / <code>@RestControllerAdvice</code> 注解的类支持 3 种类型的方法：
</p>

<ul class="org-ul">
<li>Exception handling methods annotated with <code>@ExceptionHandler</code>
</li>
<li>Model enhancement methods (for adding additional data to the model) annotated with <code>@ModelAttribute</code>
</li>
<li>Binder initialization methods (used for configuring form-handling) annotated with <code>@InitBinder</code>
</li>
</ul>


<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@ControllerAdvice</span>
<span style="color: #a1db00;">class</span> <span style="color: #00d7af;">GlobalControllerExceptionHandler</span> {
    <span style="color: #5fafd7;">@ResponseStatus</span>(<span style="color: #5fafd7;">HttpStatus</span>.<span style="color: #00d7af;">CONFLICT</span>)  <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">409</span>
    <span style="color: #5fafd7;">@ExceptionHandler</span>(DataIntegrityViolationException.<span style="color: #a1db00;">class</span>)
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">handleConflict</span>() {
        <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Nothing to do</span>
    }
}
</pre>
</div>
</div>

<div id="outline-container-sec-2-1-4-3-1" class="outline-6">
<h6 id="sec-2-1-4-3-1"><span class="section-number-6">2.1.4.3.1</span> 重新抛出</h6>
<div class="outline-text-6" id="text-2-1-4-3-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@ControllerAdvice</span>
<span style="color: #a1db00;">class</span> <span style="color: #00d7af;">GlobalDefaultExceptionHandler</span> {
  <span style="color: #a1db00;">public</span> <span style="color: #a1db00;">static</span> <span style="color: #a1db00;">final</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">DEFAULT_ERROR_VIEW</span> = <span style="color: #ff4ea3;">"error"</span>;

  <span style="color: #5fafd7;">@ExceptionHandler</span>(value = Exception.<span style="color: #a1db00;">class</span>)
  <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">ModelAndView</span> <span style="color: #ffd700;">defaultErrorHandler</span>(<span style="color: #00d7af;">HttpServletRequest</span> <span style="color: #ff8700;">req</span>, <span style="color: #00d7af;">Exception</span> <span style="color: #ff8700;">e</span>) <span style="color: #a1db00;">throws</span> <span style="color: #00d7af;">Exception</span> {
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">If the exception is annotated with @ResponseStatus rethrow it and let</span>
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">the framework handle it - like the OrderNotFoundException example</span>
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">at the start of this post.</span>
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">AnnotationUtils is a Spring Framework utility class.</span>
    <span style="color: #a1db00;">if</span> (AnnotationUtils.findAnnotation(e.getClass(), ResponseStatus.<span style="color: #a1db00;">class</span>) != <span style="color: #5fafd7;">null</span>)
      <span style="color: #a1db00;">throw</span> e;

    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">Otherwise setup and send the user to a default error-view.</span>
    <span style="color: #00d7af;">ModelAndView</span> <span style="color: #ff8700;">mav</span> = <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">ModelAndView</span>();
    mav.addObject(<span style="color: #ff4ea3;">"exception"</span>, e);
    mav.addObject(<span style="color: #ff4ea3;">"url"</span>, req.getRequestURL());
    mav.setViewName(DEFAULT_ERROR_VIEW);
    <span style="color: #a1db00;">return</span> mav;
  }
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>



<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> <a href="https://github.com/ruanhao/show-me-the-code/tree/springboot-application-event">Application Event</a></h3>
<div class="outline-text-3" id="text-2-2">
</div><div id="outline-container-sec-2-2-1" class="outline-4">
<h4 id="sec-2-2-1"><span class="section-number-4">2.2.1</span> Event</h4>
<div class="outline-text-4" id="text-2-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@ToString</span>
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Event</span> <span style="color: #a1db00;">extends</span> <span style="color: #00d7af;">ApplicationEvent</span> {

    <span style="color: #a1db00;">private</span> <span style="color: #a1db00;">static</span> <span style="color: #a1db00;">final</span> <span style="color: #00d7af;">long</span> <span style="color: #ff8700;">serialVersionUID</span> = 1L;

    <span style="color: #5fafd7;">@Getter</span>
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">message</span>;

    <span style="color: #a1db00;">public</span> <span style="color: #ffd700;">Event</span>(<span style="color: #00d7af;">Object</span> <span style="color: #ff8700;">source</span>, <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">message</span>) {
        <span style="color: #a1db00;">super</span>(source);
        <span style="color: #a1db00;">this</span>.message = message;
    }

}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-2" class="outline-4">
<h4 id="sec-2-2-2"><span class="section-number-4">2.2.2</span> Listener</h4>
<div class="outline-text-4" id="text-2-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Component</span>
<span style="color: #5fafd7;">@Slf4j</span>
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Listener</span> {

    <span style="color: #5fafd7;">@EventListener</span>
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">handlerEvent</span>(<span style="color: #00d7af;">Event</span> <span style="color: #ff8700;">event</span>) {
        log.info(<span style="color: #ff4ea3;">"Receive event: {}"</span>, event);
    }

}
</pre>
</div>
</div>
</div>
