java/springboot.org
*** Publisher

    #+BEGIN_SRC java
  @Service
  @Slf4j
  public class Publisher {

      @Autowired
      private ApplicationContext applicationContext;

      public void publish(String message) {
          log.info("Sending message: {}", message);
          applicationContext.publishEvent(new Event(this, message));
      }

  }
    #+END_SRC


*** 自定义 applicationEventMulticaster

    #+BEGIN_SRC java
  @Bean(name="applicationEventMulticaster")
  public ApplicationEventMulticaster simpleApplicationEventMulticaster() {
      SimpleApplicationEventMulticaster eventMulticaster
          = new SimpleApplicationEventMulticaster();
      eventMulticaster.setTaskExecutor(new SimpleAsyncTaskExecutor());
      return eventMulticaster;
  }
    #+END_SRC


*** 常见 SpringApplicationEvent

- ApplicationEnvironmentPreparedEvent
- ApplicationFailedEvent
- ApplicationPreparedEvent
- ApplicationReadyEvent
- ApplicationStartingEvent



** [[https://github.com/ruanhao/show-me-the-code/tree/springboot-async-method][Async Method]]


*** 异常统一捕获

    如果需要统一进行异常捕获，可以实现 =AsyncConfigurer= 接口，
    =getAsyncExecutor= 方法返回的 Executor 对象用于处理异步方法调用，
    =getAsyncUncaughtExceptionHandler= 方法返回的对象捕获异步调用期间产生的异常，
    *当且仅当异步调用方法的返回类型为 void* 。

    #+BEGIN_SRC java
  @EnableAsync
  @Configuration
  public class AsyncConfiguration implements AsyncConfigurer {

      @Override
      public Executor getAsyncExecutor() {
          ThreadPoolTaskExecutor taskExecutor = new ThreadPoolTaskExecutor();
          taskExecutor.setCorePoolSize(4);
          taskExecutor.setMaxPoolSize(8);
          taskExecutor.setQueueCapacity(32);
          taskExecutor.initialize();
          return taskExecutor;
      }

      @Override
      public AsyncUncaughtExceptionHandler getAsyncUncaughtExceptionHandler() {
          return new SimpleAsyncUncaughtExceptionHandler();
      }

  }
    #+END_SRC


** Scheduling Tasks

*** 启用计划任务

    在配置类上使用 =@EnableScheduling= 来开启对计划任务的支持。


*** 任务执行

**** 每隔固定时间执行

     #+BEGIN_SRC java
  @Scheduled(fixedRate=5000)
     #+END_SRC

**** 指定任务间隔

     #+BEGIN_SRC java
  // specify the interval between invocations measured
  // from the completion of the task
  @Scheduled(fixedDelay=5000)
     #+END_SRC

**** UNIX Cron 风格

     #+BEGIN_SRC java
  @Scheduled(cron="0 28 11 ? * *") // 每天 11 点 28 分 执行
     #+END_SRC


** [[https://github.com/ruanhao/show-me-the-code/tree/springboot-type-safe-configuration-properties][Type Safe Configuration Properties]]

*** 配置文件

    #+BEGIN_SRC sh
  #Simple properties
  mail.host=mailer@mail.com
  mail.port=9000
  mail.from=mailer@mail.com

  #List properties
  mail.defaultRecipients[0]=admin@mail.com
  mail.defaultRecipients[1]=owner@mail.com

  #Map Properties
  mail.additionalHeaders.redelivery=true
  mail.additionalHeaders.secure=true

  #Object properties
  mail.credentials.username=john
  mail.credentials.password=password
  mail.credentials.authMethod=SHA1
    #+END_SRC


*** Properties Bean

    #+BEGIN_SRC java
  @Getter
  @Setter
  @ToString
  @Configuration
  @Validated
  @PropertySource("classpath:configprops.properties")
  @ConfigurationProperties(prefix="mail")
  public class ConfigProperties {

      @Getter
      @Setter
      @ToString
      public static class Credentials {
          @Length(max=4, min=1)
          private String authMethod;
          private String username;
          private String password;
      }

      @NotBlank
      private String host;
      @Min(1025)
      @Max(65536)
      private int port;
      @Pattern(regexp="^[a-z0-9._%+-]+@[a-z0-9.-]+\\.[a-z]{2,6}$")
      private String from;

      // In order to validate values of nested properties,
      // you must annotate the associated field as @Valid to trigger its validation.
      @Valid
      private Credentials credentials;
      private List<String> defaultRecipients;
      private Map<String, String> additionalHeaders;

  }

    #+END_SRC


** 内容注入

*** 注入普通字符串

    #+BEGIN_SRC java
  @Value("I love you")
  String normal;
    #+END_SRC


