java/springboot.html


<div id="outline-container-sec-2-2-3" class="outline-4">
<h4 id="sec-2-2-3"><span class="section-number-4">2.2.3</span> Publisher</h4>
<div class="outline-text-4" id="text-2-2-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Service</span>
<span style="color: #5fafd7;">@Slf4j</span>
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Publisher</span> {

    <span style="color: #5fafd7;">@Autowired</span>
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">ApplicationContext</span> <span style="color: #ff8700;">applicationContext</span>;

    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">void</span> <span style="color: #ffd700;">publish</span>(<span style="color: #00d7af;">String</span> <span style="color: #ff8700;">message</span>) {
        log.info(<span style="color: #ff4ea3;">"Sending message: {}"</span>, message);
        applicationContext.publishEvent(<span style="color: #a1db00;">new</span> <span style="color: #00d7af;">Event</span>(<span style="color: #a1db00;">this</span>, message));
    }

}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-4" class="outline-4">
<h4 id="sec-2-2-4"><span class="section-number-4">2.2.4</span> 自定义 applicationEventMulticaster</h4>
<div class="outline-text-4" id="text-2-2-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Bean</span>(name=<span style="color: #ff4ea3;">"applicationEventMulticaster"</span>)
<span style="color: #a1db00;">public</span> <span style="color: #00d7af;">ApplicationEventMulticaster</span> <span style="color: #ffd700;">simpleApplicationEventMulticaster</span>() {
    <span style="color: #00d7af;">SimpleApplicationEventMulticaster</span> <span style="color: #ff8700;">eventMulticaster</span>
        = <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">SimpleApplicationEventMulticaster</span>();
    eventMulticaster.setTaskExecutor(<span style="color: #a1db00;">new</span> <span style="color: #00d7af;">SimpleAsyncTaskExecutor</span>());
    <span style="color: #a1db00;">return</span> eventMulticaster;
}
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-2-5" class="outline-4">
<h4 id="sec-2-2-5"><span class="section-number-4">2.2.5</span> 常见 SpringApplicationEvent</h4>
<div class="outline-text-4" id="text-2-2-5">
<ul class="org-ul">
<li>ApplicationEnvironmentPreparedEvent
</li>
<li>ApplicationFailedEvent
</li>
<li>ApplicationPreparedEvent
</li>
<li>ApplicationReadyEvent
</li>
<li>ApplicationStartingEvent
</li>
</ul>
</div>
</div>
</div>



<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> <a href="https://github.com/ruanhao/show-me-the-code/tree/springboot-async-method">Async Method</a></h3>
<div class="outline-text-3" id="text-2-3">
</div><div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> 异常统一捕获</h4>
<div class="outline-text-4" id="text-2-3-1">
<p>
如果需要统一进行异常捕获，可以实现 <code>AsyncConfigurer</code> 接口，
<code>getAsyncExecutor</code> 方法返回的 Executor 对象用于处理异步方法调用，
<code>getAsyncUncaughtExceptionHandler</code> 方法返回的对象捕获异步调用期间产生的异常，
<b>当且仅当异步调用方法的返回类型为 void</b> 。
</p>

<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@EnableAsync</span>
<span style="color: #5fafd7;">@Configuration</span>
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">AsyncConfiguration</span> <span style="color: #a1db00;">implements</span> <span style="color: #00d7af;">AsyncConfigurer</span> {

    <span style="color: #5fafd7;">@Override</span>
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">Executor</span> <span style="color: #ffd700;">getAsyncExecutor</span>() {
        <span style="color: #00d7af;">ThreadPoolTaskExecutor</span> <span style="color: #ff8700;">taskExecutor</span> = <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">ThreadPoolTaskExecutor</span>();
        taskExecutor.setCorePoolSize(4);
        taskExecutor.setMaxPoolSize(8);
        taskExecutor.setQueueCapacity(32);
        taskExecutor.initialize();
        <span style="color: #a1db00;">return</span> taskExecutor;
    }

    <span style="color: #5fafd7;">@Override</span>
    <span style="color: #a1db00;">public</span> <span style="color: #00d7af;">AsyncUncaughtExceptionHandler</span> <span style="color: #ffd700;">getAsyncUncaughtExceptionHandler</span>() {
        <span style="color: #a1db00;">return</span> <span style="color: #a1db00;">new</span> <span style="color: #00d7af;">SimpleAsyncUncaughtExceptionHandler</span>();
    }

}
</pre>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> Scheduling Tasks</h3>
<div class="outline-text-3" id="text-2-4">
</div><div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> 启用计划任务</h4>
<div class="outline-text-4" id="text-2-4-1">
<p>
在配置类上使用 <code>@EnableScheduling</code> 来开启对计划任务的支持。
</p>
</div>
</div>


<div id="outline-container-sec-2-4-2" class="outline-4">
<h4 id="sec-2-4-2"><span class="section-number-4">2.4.2</span> 任务执行</h4>
<div class="outline-text-4" id="text-2-4-2">
</div><div id="outline-container-sec-2-4-2-1" class="outline-5">
<h5 id="sec-2-4-2-1"><span class="section-number-5">2.4.2.1</span> 每隔固定时间执行</h5>
<div class="outline-text-5" id="text-2-4-2-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Scheduled</span>(fixedRate=5000)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2-2" class="outline-5">
<h5 id="sec-2-4-2-2"><span class="section-number-5">2.4.2.2</span> 指定任务间隔</h5>
<div class="outline-text-5" id="text-2-4-2-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">specify the interval between invocations measured</span>
<span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">from the completion of the task</span>
<span style="color: #5fafd7;">@Scheduled</span>(fixedDelay=5000)
</pre>
</div>
</div>
</div>

<div id="outline-container-sec-2-4-2-3" class="outline-5">
<h5 id="sec-2-4-2-3"><span class="section-number-5">2.4.2.3</span> UNIX Cron 风格</h5>
<div class="outline-text-5" id="text-2-4-2-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Scheduled</span>(cron=<span style="color: #ff4ea3;">"0 28 11 ? * *"</span>) <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">&#27599;&#22825; 11 &#28857; 28 &#20998; &#25191;&#34892;</span>
</pre>
</div>
</div>
</div>
</div>
</div>


<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> <a href="https://github.com/ruanhao/show-me-the-code/tree/springboot-type-safe-configuration-properties">Type Safe Configuration Properties</a></h3>
<div class="outline-text-3" id="text-2-5">
</div><div id="outline-container-sec-2-5-1" class="outline-4">
<h4 id="sec-2-5-1"><span class="section-number-4">2.5.1</span> 配置文件</h4>
<div class="outline-text-4" id="text-2-5-1">
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Simple properties</span>
mail.host=mailer@mail.com
mail.port=9000
mail.from=mailer@mail.com

<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">List properties</span>
mail.defaultRecipients[0]=admin@mail.com
mail.defaultRecipients[1]=owner@mail.com

<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Map Properties</span>
mail.additionalHeaders.redelivery=true
mail.additionalHeaders.secure=true

<span style="color: #6c6c6c; font-style: italic;">#</span><span style="color: #6c6c6c; font-style: italic;">Object properties</span>
mail.credentials.username=john
mail.credentials.password=password
mail.credentials.authMethod=SHA1
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-5-2" class="outline-4">
<h4 id="sec-2-5-2"><span class="section-number-4">2.5.2</span> Properties Bean</h4>
<div class="outline-text-4" id="text-2-5-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Getter</span>
<span style="color: #5fafd7;">@Setter</span>
<span style="color: #5fafd7;">@ToString</span>
<span style="color: #5fafd7;">@Configuration</span>
<span style="color: #5fafd7;">@Validated</span>
<span style="color: #5fafd7;">@PropertySource</span>(<span style="color: #ff4ea3;">"classpath:configprops.properties"</span>)
<span style="color: #5fafd7;">@ConfigurationProperties</span>(prefix=<span style="color: #ff4ea3;">"mail"</span>)
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">ConfigProperties</span> {

    <span style="color: #5fafd7;">@Getter</span>
    <span style="color: #5fafd7;">@Setter</span>
    <span style="color: #5fafd7;">@ToString</span>
    <span style="color: #a1db00;">public</span> <span style="color: #a1db00;">static</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">Credentials</span> {
        <span style="color: #5fafd7;">@Length</span>(max=4, min=1)
        <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">authMethod</span>;
        <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">username</span>;
        <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">password</span>;
    }

    <span style="color: #5fafd7;">@NotBlank</span>
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">host</span>;
    <span style="color: #5fafd7;">@Min</span>(1025)
    <span style="color: #5fafd7;">@Max</span>(65536)
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">int</span> <span style="color: #ff8700;">port</span>;
    <span style="color: #5fafd7;">@Pattern</span>(regexp=<span style="color: #ff4ea3;">"^[a-z0-9._%+-]+@[a-z0-9.-]+\\.[a-z]{2,6}$"</span>)
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">from</span>;

    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">In order to validate values of nested properties,</span>
    <span style="color: #6c6c6c; font-style: italic;">// </span><span style="color: #6c6c6c; font-style: italic;">you must annotate the associated field as @Valid to trigger its validation.</span>
    <span style="color: #5fafd7;">@Valid</span>
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">Credentials</span> <span style="color: #ff8700;">credentials</span>;
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">List</span>&lt;<span style="color: #00d7af;">String</span>&gt; <span style="color: #ff8700;">defaultRecipients</span>;
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">Map</span>&lt;<span style="color: #00d7af;">String</span>, <span style="color: #00d7af;">String</span>&gt; <span style="color: #ff8700;">additionalHeaders</span>;

}
</pre>
</div>
</div>
</div>
</div>
