java/springboot.org
*** 注入操作系统属性

    #+BEGIN_SRC java
  @Value("#{systemProperties['os.name']}")
  String osName
    #+END_SRC


*** 注入表达式结果

    #+BEGIN_SRC java
  @Value("#{ T(java.lang.Math).random() * 100.0 }")
  double randomNumber;
    #+END_SRC


*** 注入其他 Bean 属性

    #+BEGIN_SRC java
  @Value("#{anotherBean.value}")
  String another;
    #+END_SRC


*** 注入文件资源

    #+BEGIN_SRC java
  @Value("classpath:test.txt")
  Resource testFile;
    #+END_SRC


*** 注入网址资源

    #+BEGIN_SRC java
  @Value("http://www.baidu.com")
  Resource testUrl;

    #+END_SRC


*** 从配置文件注入

    #+BEGIN_SRC java
      @Configuration
      @PropertySource("classpath:jdbc.properties")
      public class MyConfig {
          @Value("${jdbc.url}")
          private String jdbcUrl;
      }


    #+END_SRC
