java/springboot.html


<div id="outline-container-sec-2-6" class="outline-3">
<h3 id="sec-2-6"><span class="section-number-3">2.6</span> 内容注入</h3>
<div class="outline-text-3" id="text-2-6">
</div><div id="outline-container-sec-2-6-1" class="outline-4">
<h4 id="sec-2-6-1"><span class="section-number-4">2.6.1</span> 注入普通字符串</h4>
<div class="outline-text-4" id="text-2-6-1">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"I love you"</span>)
<span style="color: #00d7af;">String</span> <span style="color: #ff8700;">normal</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-2" class="outline-4">
<h4 id="sec-2-6-2"><span class="section-number-4">2.6.2</span> 注入操作系统属性</h4>
<div class="outline-text-4" id="text-2-6-2">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"#{systemProperties['os.name']}"</span>)
<span style="color: #00d7af;">String</span> <span style="color: #ff8700;">osName</span>
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-3" class="outline-4">
<h4 id="sec-2-6-3"><span class="section-number-4">2.6.3</span> 注入表达式结果</h4>
<div class="outline-text-4" id="text-2-6-3">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"#{ T(java.lang.Math).random() * 100.0 }"</span>)
<span style="color: #00d7af;">double</span> <span style="color: #ff8700;">randomNumber</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-4" class="outline-4">
<h4 id="sec-2-6-4"><span class="section-number-4">2.6.4</span> 注入其他 Bean 属性</h4>
<div class="outline-text-4" id="text-2-6-4">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"#{anotherBean.value}"</span>)
<span style="color: #00d7af;">String</span> <span style="color: #ff8700;">another</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-5" class="outline-4">
<h4 id="sec-2-6-5"><span class="section-number-4">2.6.5</span> 注入文件资源</h4>
<div class="outline-text-4" id="text-2-6-5">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"classpath:test.txt"</span>)
<span style="color: #00d7af;">Resource</span> <span style="color: #ff8700;">testFile</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-6" class="outline-4">
<h4 id="sec-2-6-6"><span class="section-number-4">2.6.6</span> 注入网址资源</h4>
<div class="outline-text-4" id="text-2-6-6">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"http://www.baidu.com"</span>)
<span style="color: #00d7af;">Resource</span> <span style="color: #ff8700;">testUrl</span>;
</pre>
</div>
</div>
</div>


<div id="outline-container-sec-2-6-7" class="outline-4">
<h4 id="sec-2-6-7"><span class="section-number-4">2.6.7</span> 从配置文件注入</h4>
<div class="outline-text-4" id="text-2-6-7">
<div class="org-src-container">

<pre class="src src-java"><span style="color: #5fafd7;">@Configuration</span>
<span style="color: #5fafd7;">@PropertySource</span>(<span style="color: #ff4ea3;">"classpath:jdbc.properties"</span>)
<span style="color: #a1db00;">public</span> <span style="color: #a1db00;">class</span> <span style="color: #00d7af;">MyConfig</span> {
    <span style="color: #5fafd7;">@Value</span>(<span style="color: #ff4ea3;">"${jdbc.url}"</span>)
    <span style="color: #a1db00;">private</span> <span style="color: #00d7af;">String</span> <span style="color: #ff8700;">jdbcUrl</span>;
}
</pre>
</div>
</div>
</div>
</div>
</div>
</div>
</body>
</html>